#include <stdio.h>

//指標加減運算
/*
int v[5];

&v[0] + 1 == &v[1];
&v[0] + 2 == &v[2];
&v[1] + 1 == &v[2];
&v[1] - 1 == &v[0];

&v[0] + &v[1] // error!!
&v[2] - &v[1] == 1;
&v[3] - %v[0] == 3;
...
*/

//指標與陣列
/*
int v[5];
int *n;

n = &v[0];
n = v; //相當於n = &v[0]  陣列型別可隱性轉型為 第一個元素記憶體位置的指標

n+1 == &v[0]+1 == &v[1];   且*n == v[0]
n+2 == &v[0]+2 == &v[2];   且*(n+1) == v[1]
*/

//存取陣列元素
/*
int main(){
    int v[5] = {1,2,3,4,5};
    int *n = v; //即int *n = &v[0]
    /*
    int i;
    for (i=0;i<5;i++){
        printf("%d ", *(n+i));
    }*/

    /*
    for (n=v;n!=&v[5];n++){
        printf("%d ", *n);
    }*/

    /*
    for (n=v;n!=v+5;n++){ //v+5中的v會隱性轉型成指標
        printf("%d ", *n);
    }*//*

    while (n != v+5){
        printf("%d ", *n++); //對n先取值，再加一
    }
    return 0;
}*/

//指標與下標運算子([])(a[b] == *(a+b))
/*
int v[5];
int *n = v;
v[0] = 0; //v[0] 即*(v+0)，其中v會隱性轉型為指標
0[v] = 0; //0[v] 即*(0+v)
n[0] = 0; //n[0] 即*(n+0)==*(&v[0]+0)==*(v+0)

n[0] == *n == *v;
n[1] == *(n+1) == *(v+1);
n[2] == *(n+2) == *(v+2);
*/

//陣列歸零
int main(){
    int v[5];
    int *p = v;
    while (p != v+5){
        *p++ = 0; //即*(p++) 先取值後再加一
    }

    for (p=v;p!=v+5;p++){
        printf("%d ", *p);
    }
}
